countries_dict_lower = {
    'италия': 'it',
    'таджикистан': 'tj',
    'франция': 'fr',
    'польша': 'pl',
    'сша': 'us',
    'индия': 'in',
    'танзания': 'tz',
    'молдова': 'md',
    'кыргызстан': 'kg',
    'румыния': 'ro',
    'кения': 'ke',
    'южная африка': 'za',
    'австрия': 'at',
    'израиль': 'il',
    'россия': 'ru',
    'азербайджан': 'az',
    'казахстан': 'kz',
    'греция': 'gr',
    'украина': 'ua',
    'узбекистан': 'uz',
    'грузия': 'ge',
    'испания': 'es',
    'португалия': 'pt',
    'республика беларусь': 'by',
    'нидерланды': 'nl'
}

countries_list = [
    'Таджикистан', 'Польша', 'США',
    'Кыргызстан', 'Россия',
    'Азербайджан', 'Казахстан', 'Украина', 'Узбекистан',
    'Республика Беларусь',
]

origin_codes = {
    'москва': 'MOW',
    'санкт-петербург': 'LED',
    'нью-йорк': 'JFK',
    'лондон': 'LHR',
    'париж': 'CDG',
    'токио': 'HND',
    'дубай': 'DXB',
    'пекин': 'PEK',
    'сингапур': 'SIN',
    'сидней': 'SYD',
    'ташкент': 'TAS',  # Пример для Ташкента, Узбекистан
    'самарканд': 'SKD',  # Пример для Самарканда, Узбекистан
    'бухара': 'BHK',  # Пример для Бухары, Узбекистан
    'душанбе': 'DYU',  # Пример для Душанбе, Таджикистан
    'навои': 'NVI',
    'андижан': 'AZN',
    'фергана': 'FEG',
    'карши': 'KSQ',
    'ургенч': 'UGC',
    'нукус': 'NCU',
    'наманган': 'NMA',
    'термез': 'TMJ',
    'внуково': 'VKO',
    'шереметьево': 'SVO',
    'жуковский': 'ZIA',
}

reversed_origin_codes = {value: key for key, value in origin_codes.items()}
